function changeBackground() {
    var body = document.getElementsByTagName("body")[0]

    // ----- COLOUR PALETTES ------

    // BRIGHT COLOURFUL THEME
    const colors0 = ["#ffcc99", "#ffbf80", "#ffb366", "#f2d7d5", "#fadbd8", "#f9ebea", "#fdedec", "#f5eef8", "#f4ecf7",
    "#ffa64d", "#ffcccc", "#ffb3b3", "#ff9999", "#ff8080", "#ff6666", "#ffb3ff",
    "#d1e0e0", "#c2d6d6", "#b3cccc", "#a3c2c2", " #94b8b8", "#85adad", "#75a3a3", "#669999", "#5c8a8a", "#527a7a"];

    // SKY BLUE THEME
    const colors1 = ["#0a1429", "#0f1f3d", "#142952", "#193366", "#1f3d7a", "#24478f", "#2952a3", "#5499c7", "#2980b9",
        "CornflowerBlue", "MediumSlateBlue", "CadetBlue", "#5dade2", "#3498db", "#2e86c1", "#2874a6",
        "#21618c", "#1b4f72", "#eaf2f8", "#d4e6f1", "#a9cce3", "#7fb3d5"];

    // GREEN THEME
    const colors2 = ["#148f77", "#17a589", "#1abc9c", "#48c9b0", "#76d7c4", "#a3e4d7", "#e8f6f3", "#d0ece7",
        "#a2d9ce", "#73c6b6", "#45b39d", "#16a085"];

    // LILAC THEME
    const colors3 = ["#d7bde2", "#c39bd3", "#af7ac5", "#9b59b6", "#884ea0", "#76448a", "#f4ecf7", "#e8daef",
        "#d2b4de", "#bb8fce", "#a569bd", "#8e44ad"];

    // SUNNY BRIGHT THEME
    const colors4 = ["#fcf3cf", "#f9e79f", "#f7dc6f", "#f4d03f", "#f1c40f", "#d4ac0d", "#fdebd0", "#fad7a0",
        "#f8c471", "#f5b041", "#f39c12", "#d68910"];

    // ORANGE SKY
    const colors5 = ['#fae5d3', '#f5cba7', '#f0b27a', '#eb984e', '#e67e22', '#ca6f1e',
    '#edbb99', '#e59866', '#dc7633', '#d35400', '#ba4a00', '#a04000']

    // GRAY STORM
    const colors6 = ['#b2babb', '#99a3a4', '#7f8c8d', '#707b7c', '#616a6b', '#515a5a',
    '#bfc9ca', '#aab7b8', '#95a5a6', '#839192', '#717d7e', '#5f6a6a']


    // All colour palettes in a list
    let colorThemes = [colors0, colors1, colors2, colors3, colors4, colors5, colors6];

    // Get the chosen profile theme index from the invisible input in the 'base.html' file
    let indexTheme = Number(document.getElementById("colorTheme").value);

    // Select the chosen colour palette
    const chosen_color_theme = colorThemes[indexTheme];

    // Select random index from the chosen palette
    index = Math.floor(Math.random() * chosen_color_theme.length);

    // Assign the  new colour to be  the  new background colour
    body.style.backgroundColor = chosen_color_theme[index];




//     let quote = document.getElementById('quotetext');
//     // var quote_to_be = document.getElementById("qqq").value;
//     let quotes = ['"Work is the least important thing and family is the most important" ~ Jerry Seinfeld in TV Guide',
//     '"Courage  is not about being afraid, it is about understanding that something else is  more important than being afraid" ~ Galadriel',
//     '"There is  no element of genious without some form of madness" ~ Leonardo Dicaprio',
//     '"There are two kinds of women - the kind that drive a man to drink and  the kind that drive a man to do great things. If you found the  woman who could do both, that would be the one  to marry" ~ Caeria, FF.net',
//     '"Задачата ти не е да търсиш любов, а чисто и просто да откриеш бариерите в себе си, които си изградил срещу нея. ~ Джеляледдин Руми - Мевляна"',
//     '"Не знаеш ли все още? Твоята светлива запалва световете. Разкъсай маската. Лицето ти е великолепно. Ти си огледало, отразяващо величествено лице. Тази Вселена не е отвън теб. Погледни в себе си. Всичко, което искаш, ти вече си това. Душата на душата на Вселената е Любов. Не си капка в океана. Ти си целият океан в една капка." ~ Джеляледдин Руми - Мевляна',
//     '"... защото любовта не е само между двама влюбени, не е само цел или крайна дестинация. Любовта е самият процес, светоусещането, разцъфтяването: Любовта не почива на ничия основа, тя е безкраен океан, без начало и край. Това е любовта: да летиш към тайно небе, да накараш стотици завеси да падат във всеки един момент, първо да се откажеш от живота, накрая да направиш стъпка, без нозете ти да помръднат." ~ Джеляледдин Руми - Мевляна',
//     '"Затворих устата си и ти заговорих по стотици безмълвни начина. Търпението не е в това, да стоиш и да чакаш. То е в предвиждането. То е в това, да гледаш в нощта и да виждаш деня. Влюбените са търпеливи и значт, че е нужно време, за да стане луната пълна." ~ Джеляледдин Руми - Мевляна',
//     '"Ще чакам тук. Мълчанието ти да се пречупи, душата ти да се разтърси, любовта ти да се пробуди." ~ Джеляледдин Руми - Мевляна',
//     '"Това, което търсиш, търси теб." ~ Джеляледдин Руми - Мевляна',
//     '"Ако чашата ни е малка, нямаме право да обвиняваме морето." ~ Джеляледдин Руми - Мевляна',
//     '"Когато правиш нещата от душа, чувстваш една река да тече през теб, една радост." ~ Джеляледдин Руми - Мевляна',
//     '"Не тъжи. Всичко, което си изгубил, се връща при теб под друга форма." ~ Джеляледдин Руми - Мевляна',
//     '"Там, където има руини, има и надежда за съкровище." ~ Джеляледдин Руми - Мевляна',
//     '"Тишината е езикът на Бога, всичко останало е лош превод." ~ Джеляледдин Руми - Мевляна',
//     '"Всичко във вселената се намира вътре в теб. Искай от себе си." ~ Джеляледдин Руми - Мевляна',
//     '"Преди книгите да се опитаме да прочетем себе си." ~ Джеляледдин Руми - Мевляна',
//     '"Ако искаш винаги да светиш като ден, тогава изгори онази своя част, която прилича на нощ." ~ Джеляледдин Руми - Мевляна',
//     '"Ако душата ти не е радостна, когато очите ти са отворени, знай, че е затворено окото в сърцето ти. Отвори го." ~ Джеляледдин Руми - Мевляна',
//     '"Човек, който говори не това, което чувства, се смята за ням, дори и да има сто езика." ~ Джеляледдин Руми - Мевляна',
//     '"Причината за всяка грижа е някакво лошо действие. Лошотията се дължи на твоите действия, а не на съдбата ти." ~ Джеляледдин Руми - Мевляна',
//     '"Знай, че делото, произлязло от твоята душа и тяло, се хваща за полата ти като твое дете." ~ Джеляледдин Руми - Мевляна',
//     '"Един камък не може да се раззелени, дори да стане свидетел на хиляда пролети." ~ Джеляледдин Руми - Мевляна',
//     '"Допитай се до самолюбието си относно делото, което смяташ да извършиш, и каквото те посъветва, ти направи обратното." ~ Джеляледдин Руми - Мевляна',
//     '"Когато себичността дойде, Бог си отива." ~ Джеляледдин Руми - Мевляна',
//     '"Малките герои побеждават своите врагове. Големите герои побеждават себе си." ~ Джеляледдин Руми - Мевляна',
//     '"Много от грешките, които виждаш у другите, са собствените ти грешки, отразени обратно към теб. В действителност, ти жигосваш и обвиняваш себе си." ~ Джеляледдин Руми - Мевляна',
//     '"Търси лекарството за болестта в привичките на болния." ~ Джеляледдин Руми - Мевляна',
//     '"Видяхме толкова хора без дрехи на гърба си. Видяхме толкова дрехи без хора вътре в тях." ~ Джеляледдин Руми - Мевляна',
//     '"Потрудете се за всяко свое желание, работете, защото е нужно да положите страдание за него." ~ Джеляледдин Руми - Мевляна',
//     '"Щом човек е доволен, значи е зарадвал някого, ако е разтревожен, значи е натъжил някого." ~ Джеляледдин Руми - Мевляна',
//     '"Ако търсиш подслон за душата, значи си душа; ако дириш парче хляб, си хляб; ако търсиш капка вода, си вода; ако си по дирите на жестокостта, си тиранин;ако дириш любов, си влюбен. Ти си онова, което жадува душата ти." ~ Джеляледдин Руми - Мевляна',
//     '"Бъди силен, без да проявяваш насилие, бъди мек, без да показваш слабост." ~ Джеляледдин Руми - Мевляна',
//     '"Една свещ не губи нищо от светлината си, ако запали друга свещ." ~ Джеляледдин Руми - Мевляна',
//     '"Светът е планина и нашите действия са викове, които ехото връща към нас." ~ Джеляледдин Руми - Мевляна',
//     '"Животът поставя пред нас различни видове храна, за да се види какви животни сме." ~ Джеляледдин Руми - Мевляна',
//     '"Бъди нащрек! Спри да изричаш "утре". Много "утре" са идвали и са отминавали. Ако не внимаваш, времето за сеене ще изтече." ~ Джеляледдин Руми - Мевляна',
//     '"Един знаещ човек е знаещ поради любовта в сърцето си, а не заради бялата си брада." ~ Джеляледдин Руми - Мевляна',
//     '"Не ще спечелиш сърцето на Възлюбления, ако не пожертваш главата си." ~ Джеляледдин Руми - Мевляна',
//     '"Какво е любовта? Не ще научиш никога, докато не изгубиш себе си във Възлюбения." ~ Джеляледдин Руми - Мевляна',
//     '"В този свят си риба в морето. Когато умреш ти отново ще си в морето, защото ти си морето." ~ Джеляледдин Руми - Мевляна',
//     '"Търси в себе си всичко, което пожелаеш! Вътре в душата ти има душа, нея търси! В твоята планина има съкровище, него търси! Ако търсиш странстващия мъдрец, то не го дири извън себе си, а в собствената си личност!"  ~ Джеляледдин Руми - Мевляна',
//     '"Няма нужда от онзи, който все се изразява чрез слова ..." ~ Джеляледдин Руми - Мевляна',
//     '"Изпрати мислите си да спят, не им позволявай да хвърлят сянка върху луната на твоето сърце. Спри да мислиш!" ~ Джеляледдин Руми - Мевляна',
//
// ];

    // index_quote = Math.floor(Math.random() * quotes.length);
    // chosen_quote = quotes[index_quote];
    // quote.innerHTML = chosen_quote;


  

}

// „Запуши ушите си и след това слушай. Успокой ума си и след това помни.“
// „Ако облаците не плачат, как ще се смеят цветята?“